test_runs/load/sync/many/artillery_output.txt
Phase started: WarmUp (index: 0, duration: 30s) 18:54:19(-0300)

--------------------------------------
Metrics for period to: 18:54:30(-0300) (width: 9.177s)
--------------------------------------

http.codes.200: ................................................................ 45
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1158
  max: ......................................................................... 1309
  median: ...................................................................... 1176.4
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1300.1
http.responses: ................................................................ 45
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 50
vusers.created_by_name.sync: ................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1165.3
  max: ......................................................................... 1339
  median: ...................................................................... 1176.4
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1326.4


Phase completed: WarmUp (index: 0, duration: 30s) 18:54:49(-0300)

Phase started: RampUp (index: 1, duration: 30s) 18:54:49(-0300)

--------------------------------------
Metrics for period to: 18:54:40(-0300) (width: 9.163s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1156
  max: ......................................................................... 1169
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.sync: ................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1160.2
  max: ......................................................................... 1181.2
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 18:54:50(-0300) (width: 9.163s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1155
  max: ......................................................................... 1164
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1153.1
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.sync: ................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1157.9
  max: ......................................................................... 1168.7
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 18:55:00(-0300) (width: 9.669s)
--------------------------------------

http.codes.200: ................................................................ 74
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 75
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1180
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1176.4
http.responses: ................................................................ 74
vusers.completed: .............................................................. 74
vusers.created: ................................................................ 75
vusers.created_by_name.sync: ................................................... 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.6
  max: ......................................................................... 1187.2
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 18:55:10(-0300) (width: 9.665s)
--------------------------------------

http.codes.200: ................................................................ 85
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 96
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1458
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1465.9
http.responses: ................................................................ 85
vusers.completed: .............................................................. 85
vusers.created: ................................................................ 96
vusers.created_by_name.sync: ................................................... 96
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156.4
  max: ......................................................................... 1459.9
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1465.9


Phase completed: RampUp (index: 1, duration: 30s) 18:55:20(-0300)

Phase started: Plain (index: 2, duration: 120s) 18:55:20(-0300)

--------------------------------------
Metrics for period to: 18:55:20(-0300) (width: 9.851s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1605
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156.7
  max: ......................................................................... 1606.9
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:55:30(-0300) (width: 9.856s)
--------------------------------------

http.codes.200: ................................................................ 113
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 113
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1602
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1465.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 113
vusers.completed: .............................................................. 113
vusers.created: ................................................................ 113
vusers.created_by_name.sync: ................................................... 113
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.8
  max: ......................................................................... 1605.5
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1465.9
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:55:40(-0300) (width: 9.849s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1152
  max: ......................................................................... 1605
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.6
  max: ......................................................................... 1606.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:55:50(-0300) (width: 9.848s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1607
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.5
  max: ......................................................................... 1609.6
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1620
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:56:00(-0300) (width: 9.854s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1602
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1607.3
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 18:56:10(-0300) (width: 9.852s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1151
  max: ......................................................................... 1603
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.3
  max: ......................................................................... 1607.3
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 18:56:20(-0300) (width: 9.848s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1152
  max: ......................................................................... 1605
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.3
  max: ......................................................................... 1607.7
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:56:30(-0300) (width: 9.852s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1601
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.7
  max: ......................................................................... 1607.2
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 18:56:40(-0300) (width: 9.849s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1151
  max: ......................................................................... 1605
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.3
  max: ......................................................................... 1610.5
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:56:50(-0300) (width: 9.862s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1150
  max: ......................................................................... 1607
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.3
  max: ......................................................................... 1608.5
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:57:00(-0300) (width: 9.849s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1152
  max: ......................................................................... 1611
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.4
  max: ......................................................................... 1614
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1620
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 18:57:10(-0300) (width: 9.85s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1601
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1606.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


Phase completed: Plain (index: 2, duration: 120s) 18:57:20(-0300)

Phase started: Cleanup (index: 3, duration: 15s) 18:57:20(-0300)

--------------------------------------
Metrics for period to: 18:57:20(-0300) (width: 9.85s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1151
  max: ......................................................................... 1604
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1607.6
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620


Phase completed: Cleanup (index: 3, duration: 15s) 18:57:35(-0300)

--------------------------------------
Metrics for period to: 18:57:30(-0300) (width: 2.301s)
--------------------------------------

http.codes.200: ................................................................ 29
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 12
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1603
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 29
vusers.completed: .............................................................. 29
vusers.created: ................................................................ 12
vusers.created_by_name.sync: ................................................... 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1608.2
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1620
  p99: ......................................................................... 1620


All VUs finished. Total time: 3 minutes, 18 seconds

--------------------------------
Summary report @ 18:57:36(-0300)
--------------------------------

http.codes.200: ................................................................ 1886
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 1886
http.response_time:
  min: ......................................................................... 1150
  max: ......................................................................... 1611
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 1886
vusers.completed: .............................................................. 1886
vusers.created: ................................................................ 1886
vusers.created_by_name.sync: ................................................... 1886
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1614
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1620